## **2. Pandas 문제 (1)**

* Pandas 선언

In [1]:
# 1) pandas 패키지 로드하여 pd로 사용
import pandas as pd
# 2) numpy 패키지 로드하여 np로 사용
import numpy as np

## **3. Pandas 문제 (2)**

* Pandas 파일 업로드
* [titanic.csv 파일 다운로드 링크](https://drive.google.com/file/d/1Q-Q2Y9nhHzAFAipnOcbWNGatPTlzBXNl/view?usp=sharing)

In [20]:
# 3) 파일의 경로를 복사하여 titanic.csv 파일 불러오기
titanic = pd.read_csv("../Part2/titanic.csv")

## **4. Pandas 문제 (3)**

* Pandas 데이터 내용 확인

In [4]:
# 1) titanic 데이터 상단의 9개 행 출력
titanic.head(9)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [6]:
# 2) titanic 데이터 크기 확인
titanic.shape

(891, 12)

In [27]:
# 3) titanic 데이터의 행과 열 크기, 컬럼명, 컬럼별 결측치, 컬럼별 데이터 타입 출력해주는 함수 구현
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  10Pclass     891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

## **5. Pandas 문제 (4)**

* Pandas 특정 열 선택

In [7]:
# 1) titanic 데이터에서 'Age' 열을 선택하여 titanic_age 변수에 삽입하여 head 함수 이용하여 출력
titanic_age = titanic['Age']
titanic_age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [8]:
# 2) titanic_age 변수가 Series(시리즈) 객체인지 출력하여 데이터 타입 확인
type(titanic_age)

pandas.core.series.Series

In [28]:
# 3) titanic_age 변수 크기 출력
titanic_age.shape

(891,)

In [21]:
# 4) titanic 데이터에서 'Fare', 'Cabin' 열을 선택하여 titanic_fare_cabin 변수에 삽입하여 head 함수 이용하여 출력
titanic_fare_cabin = titanic[['Fare', 'Cabin']]
titanic_fare_cabin.head()

      Fare Cabin
0   7.2500   NaN
1  71.2833   C85
2   7.9250   NaN
3  53.1000  C123
4   8.0500   NaN

In [10]:
# 5) titanic_fare_cabin 변수가 데이터프레임(DataFrame) 객체인지 출력하여 데이터 타입 확인
type(titanic_fare_cabin)

pandas.core.frame.DataFrame

In [29]:
# 6) titanic_fare_cabin 변수 크기 출력
titanic_fare_cabin.shape

(891, 2)

## **6. Pandas 문제 (5)**

* Pandas 데이터 필터링

In [30]:
# 1) 조건 : '5. Pandas 문제 (4)-4' 에서 가공한 titanic_fare_cabin 데이터에서 fare(요금)이 50 이상인 사람은 True 출력, 그외는 False 출력
# 2) (1) 조건을 적용한 값 출력 (True, False 반환)

titanic_fare_cabin['Fare'] >= 50

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Fare, Length: 891, dtype: bool

In [31]:
# 3) 조건 : '5. Pandas 문제 (4)-4' 에서 가공한 titanic_fare_cabin 데이터에서 fare(요금)이 50이상인 사람만 적용하여 추출
titanic_fare_cabin[titanic_fare_cabin['Fare'] >= 50]

          Fare        Cabin
1      71.2833          C85
3    1000.0000         C123
6      51.8625          E46
27    263.0000  C23 C25 C27
31    146.5208          B78
..         ...          ...
856   164.8667          NaN
863    69.5500          NaN
867    50.4958          A24
871    52.5542          D35
879    83.1583          C50

[161 rows x 2 columns]

## **7. Pandas 문제 (6)**

* Pandas 결측치 제거

In [17]:
# 1) 원본 titanic 데이터에서 결측 값이 존재하는 열 제거하여 출력
titanic = titanic.dropna(axis=1)
titanic

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

## **8. Pandas 문제 (7)**

* Pandas 인덱스로 특정 행과 열 선택

In [32]:
# 1) '5. Pandas 문제 (4)-4' 에서 가공한 titanic_fare_cabin 데이터에서 3번째 행, 0번째 열의 값을 "1000"으로 변경
# 2) 상단 5개의 행 출력
print("변경 전:\n", titanic_fare_cabin.head())
print("*" * 20)
titanic_fare_cabin.iloc[3, 0] = 1000
print("변경 후:\n", titanic_fare_cabin.head())

변경 전:
         Fare Cabin
0     7.2500   NaN
1    71.2833   C85
2     7.9250   NaN
3  1000.0000  C123
4     8.0500   NaN
********************
변경 후:
         Fare Cabin
0     7.2500   NaN
1    71.2833   C85
2     7.9250   NaN
3  1000.0000  C123
4     8.0500   NaN

## **9. Pandas 문제 (8)**

* Pandas 데이터 통계

In [23]:
# 1) '8. Pandas 문제 (7)-1'에서 가공한 titanic_fare_cabin 데이터에서 'Fare' 변수의 다양한 통계 요약
titanic_fare_cabin['Fare'].describe()

count     891.000000
mean       33.266946
std        59.331335
min         0.000000
25%         7.910400
50%        14.454200
75%        31.000000
max      1000.000000
Name: Fare, dtype: float64

In [24]:
# 2) 원본 titanic 데이터에서 'Survived', 'Pclass'로 묶어주고 'Age'와 'Fare' 평균 구하기
titanic.groupby(['Survived', 'Pclass'])[['Age', 'Fare']].mean()

                       Age       Fare
Survived Pclass
0        1       43.695312  64.684007
         2       33.544444  19.412328
         3       26.555556  13.669364
1        1       35.368197  95.608029
         2       25.901566  22.055700
         3       20.646118  13.694887

In [34]:
# 3) 원본 titanic 데이터에서 'Survived'의 각 카테고리별 개수 구하기
# [x] 카테고리별 개수: .value_counts()
titanic['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

## **10. Pandas 문제 (9)**

* Pandas 열 추가

In [26]:
# 1) 원본 titanic 데이터에서 "Pclass" 변수에 10을 곱하여 "10Pclass" 변수에 저장하여 출력
titanic['10Pclass'] = titanic['Pclass'] * 10
print("Pclass:\n", titanic['Pclass'])
print("10Pclass:\n", titanic['10Pclass'])

Pclass:
 0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64
10Pclass:
 0      30
1      10
2      30
3      10
4      30
       ..
886    20
887    10
888    30
889    10
890    30
Name: 10Pclass, Length: 891, dtype: int64